In [ ]:
Ex.No:1 INTRODUCTION OT DATA SCIENCE WITH PYTHON PROGRAMMING

Reg:URK22AI1026


Aim:

Write a python program to demonstrate the basics of dictionary, list, set, tuple, array and
csv files for data science application.

Description:

Lists:

Lists are mutable data types in Python. Lists is a 0-based index datatype meaning the index
of the first element starts at 0. Lists are used to store multiple items in a single variable.
Lists are one of the 4 data types present in Python

Dictionary:

Dictionaries are mutable data types in nature meaning they can be updated after they are
created. Syntactically they are written in a key, value pair format inside curly braces.
{Key1:Value1,Key2:Value2,Key3:Value3,Key4:Value4}
Keys are always unique and there cannot be any duplicates. There is no index in the
dictionary meaning they are not ordered. Key is the default iterator and is used to retrieve
the value.

Tuple:

Tuples are the same as lists are with the exception that the data once entered into the tuple
cannot be changed no matter what. The only exception is when the data inside the tuple is
mutable, only then the tuple data can be changed
Creating a Tuple
Tuple is created by using parenthesis or using the tuple() function.
my_tuple = (1, 2, 3) #create tuple
print(my_tuple)
Output:
(1, 2, 3)

Sets:
    
Sets are a collection of unordered elements that are unique. Meaning that even if the data is
repeated more than one time, it would be entered into the set only once. It resembles the
sets that you have learnt in arithmetic. The operations also are the same as is with the
arithmetic sets.
Creating a set
Sets are created using the flower braces but instead of adding key-value pairs, values are
passed into it.
my_set = {1, 2, 3, 4, 5, 5, 5} #create set
print(my_set)
Output:
{1, 2, 3, 4, 5}

CSV Files:
    
CSV stands for “Comma Separated Values.” It is the simplest form of storing data in tabular
form as plain text. It is important to know to work with CSV because we mostly rely on
CSV data in our day-to-day lives as data scientists.

In [ ]:
1. Create an empty dictionary and fill with some sub_code and sub_name as pair by user
input. Then take one sub_code as input from the user and traverse through dictionary
to find the corresponding sub_name and display the same.

In [1]:
def students(n):
    result = {}
    for _ in range(n):
        roll_no = int(input("Roll No: "))
        std_name = input("Student Name: ")
        result[roll_no] = [std_name]
    print(result)
    rn = int(input("give_the roll_no:"))
    if rn in result:
        print("It is found :)")
    else:
        print("It is not found")


n = int(input("Enter No of Students:"))
students(n)

Enter No of Students: 2
Roll No:  22
Student Name:  a
Roll No:  33
Student Name:  b

{22: ['a'], 33: ['b']}

give_the roll_no: 44

It is not found

In [ ]:
2. Create an empty list and fill with list of words by user input. Find the list of words that
are longer than n from a given list of words.

In [2]:
print([i for i in ["The","quick"," brown ","fox","jumps","over","the","lazy","dog"] if len(i)>3])

['quick', ' brown ', 'jumps', 'over', 'lazy']

In [ ]:
3. Create an empty set and fill with some values by user input. Check if a given value is
present in a set or not.

In [3]:
set1 = set()
print("Initial blank Set: ")
print(set1)

set2 = set(["aravind", "god", "elgin"])
print(set2)

Initial blank Set:
set()
{'elgin', 'aravind', 'god'}

In [ ]:
4. Create an empty tuple and fill with some values by user input. Count the occurrence of
a given input number in the tuple.

In [4]:
def countX(tup, x):
    count = 0
    for ele in tup:
        if (ele == x):
            count = count + 1
    return count


tup = (10, 8, 5, 2, 10, 15, 10, 8, 5, 8, 8, 2)
enq = 4
enq1 = 10
enq2 = 8

print(countX(tup, enq))
print(countX(tup, enq1))
print(countX(tup, enq2))

0
3
4

In [ ]:
5.Create a 2D array and perform matrix subtraction using numpy.

In [5]:
import numpy as khk
a= khk.array([[1,2,3],[4,5,6]])
b= khk.array([[11,21,31],[41,51,61]])
result = khk.subtract(a,b)
print(result)

[[-10 -19 -28]
 [-37 -46 -55]]

In [ ]:
6. Read an .csv file and display the basic details.

In [6]:
import pandas as pd
# import numpy as np
data = pd.DataFrame()
print(data)

Empty DataFrame
Columns: []
Index: []

In [7]:
df=pd.read_csv("titanic3.csv")
df

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1305,3.0,0.0,"Zabour, Miss. Thamine",female,NaN,1.0,0.0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3.0,0.0,"Zakarian, Mr. Mapriededer",male,26.5000,0.0,0.0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3.0,0.0,"Zakarian, Mr. Ortin",male,27.0000,0.0,0.0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3.0,0.0,"Zimmerman, Mr. Leo",male,29.0000,0.0,0.0,315082,7.8750,NaN,S,NaN,NaN,NaN
1309,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
print(df.dtypes)#all the type of datatype of data

pclass       float64
survived     float64
name          object
sex           object
age          float64
sibsp        float64
parch        float64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [9]:
print(df.info)#all the type of information of data

<bound method DataFrame.info of       pclass  survived                                             name  \
0        1.0       1.0                    Allen, Miss. Elisabeth Walton
1        1.0       1.0                   Allison, Master. Hudson Trevor
2        1.0       0.0                     Allison, Miss. Helen Loraine
3        1.0       0.0             Allison, Mr. Hudson Joshua Creighton
4        1.0       0.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
...      ...       ...                                              ...
1305     3.0       0.0                            Zabour, Miss. Thamine
1306     3.0       0.0                        Zakarian, Mr. Mapriededer
1307     3.0       0.0                              Zakarian, Mr. Ortin
1308     3.0       0.0                               Zimmerman, Mr. Leo
1309     NaN       NaN                                              NaN

         sex      age  sibsp  parch  ticket      fare    cabin embarked boat  \
0     female  29.0000    0.0    0.0   24160  211.3375       B5        S    2
1       male   0.9167    1.0    2.0  113781  151.5500  C22 C26        S   11
2     female   2.0000    1.0    2.0  113781  151.5500  C22 C26        S  NaN
3       male  30.0000    1.0    2.0  113781  151.5500  C22 C26        S  NaN
4     female  25.0000    1.0    2.0  113781  151.5500  C22 C26        S  NaN
...      ...      ...    ...    ...     ...       ...      ...      ...  ...
1305  female      NaN    1.0    0.0    2665   14.4542      NaN        C  NaN
1306    male  26.5000    0.0    0.0    2656    7.2250      NaN        C  NaN
1307    male  27.0000    0.0    0.0    2670    7.2250      NaN        C  NaN
1308    male  29.0000    0.0    0.0  315082    7.8750      NaN        S  NaN
1309     NaN      NaN    NaN    NaN     NaN       NaN      NaN      NaN  NaN

       body                        home.dest
0       NaN                     St Louis, MO
1       NaN  Montreal, PQ / Chesterville, ON
2       NaN  Montreal, PQ / Chesterville, ON
3     135.0  Montreal, PQ / Chesterville, ON
4       NaN  Montreal, PQ / Chesterville, ON
...     ...                              ...
1305    NaN                              NaN
1306  304.0                              NaN
1307    NaN                              NaN
1308    NaN                              NaN
1309    NaN                              NaN

[1310 rows x 14 columns]>

In [10]:
print(df.describe())#stastc.... information

            pclass     survived          age        sibsp        parch  \
count  1309.000000  1309.000000  1046.000000  1309.000000  1309.000000
mean      2.294882     0.381971    29.881135     0.498854     0.385027
std       0.837836     0.486055    14.413500     1.041658     0.865560
min       1.000000     0.000000     0.166700     0.000000     0.000000
25%       2.000000     0.000000    21.000000     0.000000     0.000000
50%       3.000000     0.000000    28.000000     0.000000     0.000000
75%       3.000000     1.000000    39.000000     1.000000     0.000000
max       3.000000     1.000000    80.000000     8.000000     9.000000

              fare        body
count  1308.000000  121.000000
mean     33.295479  160.809917
std      51.758668   97.696922
min       0.000000    1.000000
25%       7.895800   72.000000
50%      14.454200  155.000000
75%      31.275000  256.000000
max     512.329200  328.000000

In [11]:
print(df.size) #rXc rows X columns
print()
print(df.shape) #2D, 3 , nD
print()
print(df.columns) #columns

18340

(1310, 14)

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')